{"169353":"02/ ","169714":"03/ ","20991839":"All projects","240d5f":"MENU","3c2336d":"About","24737c59":"All Projects","560f747e":"Services","-64104400":"Contact","79860ec2":"Our Mission:","6aad0f16":"Blu Group Creative's mission is to embolden brands, enterprises, and individuals with the instruments of innovation and creativity. We aim to be catalysts for transformation, reshaping industries and perceptions through strategic design thinking. Our dedication lies in forging profound connections between ideas and audiences, cultivating engagement that extends beyond superficial aesthetics. We aspire to be more than service providers; we strive to become partners in our clients' odysseys, collaboratively steering them towards triumphs that are resonant, genuine, and enduring.","19cda03e":"Our Vision:","4715f30f":"Blu Group Creative envisions a realm where creativity thrives boundlessly. We envisage brands that are not merely acknowledged, but celebrated for their authenticity and imaginative brilliance. We envision narratives that universally resonate, sparking meaningful dialogues and inspiring positive change. Our vision encompasses leading the forefront of design and innovation, setting benchmarks that redefine creative landscapes. Our vision transcends the present, extending into a future where innovation knows no bounds, and the influence of creativity traverses every border.","2e834810":"The Collective Brilliance of Blu Group Creative","-46df5ea6":"Huy Nguyen","1042d":"CEO","24eeab":"Name","4d13238":"Title","-13e0cf3b":"Let's talk","-77dafdc8":"Your name","b4ee8c":"Your e-mail","2a":"*","-63dc6819":"Message","5a0ea5a1":"Thank you! Your submission has been received!","-7c112e99":"Oops! Something went wrong while submitting the form.","7f274abe":"Contact us","1ed033d4":"Address","-7ce5099f":"273/3 Nguyen Trong Tuyen St.,Phu Nhuan Dist., Ho Chi Minh City","3ff5b7c":"Email","5fe68e1a":"hello@blugroup.one","-6c1e0fd9":"Copyright © 2023 Blu Creative All rights reserved.","1b03ec49":"Sculpting ","507dd5a":"your brand","1f45680":" into","-1cd53c7a":"a masterpiece that resonates ","3841f997":"with your audience.","-cd5cc80":"Learn more about us","581e133f":"They trusted us","391b85":"Our work","3d503d2b":"No items found.","-2e8f662f":"See all our work","-7c50ee3d":"Our journey commenced with a shared conviction that the ordinary can metamorphose into the extraordinary through innovation and artistic brilliance.","-2d422d1f":"What we do","625f6585":"We leverage brands through winning strategies and complex techniques","5d08f44":"Creative Service","69efcce2":"Ensure your brand is always represented in the best way possible with a professionally designed suite of collateral. We have an inhouse team of design experts who are across all forms of businesscollateral for your brand. We create custom items based on your exact needs, and we take the stress of dealing with printers and suppliers out of your hands. Speak to us about any of your ad hoc design needs.","168f92":"01/ ","2572f1b":"Branding","8b13f04":"At Blu Group Creative, our branding service is more than just design – it's a transformative journey that empowers your brand to tell a compelling story. We believe that a brand is not just a logo; it's an experience, an emotion, and a promise. Our dedicated team of branding experts delves deep into the essence of your business, uncovering its unique personality and aspirations. With a meticulous blend of strategic thinking and artistic flair, we craft an identity that resonates with your target audience, leaving a lasting imprint.","35c0735c":"3D/CGI service","-3770a983":"You need to create your 3D commercials? we have best-in-town artists you can find. With more than 20 years in the fields, our artists involved in many different projects with highest quality.","7877dfeb":"Client","-77a8893":"Project scope:","-68b9b022":"Description:","-73cd6d8e":"Project snapshots:"}